// «Resume»: продолжить выполнение, быстрая клавиша F8.
// «Step»: выполнить следующую команду, быстрая клавиша F9.
// «Step over»: выполнить следующую команду, но не заходя внутрь функции, быстрая клавиша F10.
// «Step into»: step, который реагирует на асинхроннный код, быстрая клавиша F11.
// «Step out»: продолжить выполнение до завершения текущей функции, быстрая клавиша Shift+F11.


// -------------------------------------------------------------------------------


// Пример синтаксиса JSDoc

// /**
//  * Возвращает x, возведённое в n-ную степень.
//  *
//  * @param {number} x Возводимое в степень число.
//  * @param {number} n Степень, должна быть натуральным числом.
//  * @return {number} x, возведённое в n-ную степень.
//  */


// -------------------------------------------------------------------------------


